Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/ФормаСопоставлениеРеквизитовТабличнойЧасти/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ИмяОбъектаМетаданных", ИмяОбъектаМетаданных) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Документы.Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СоответствияРеквизитовТабличныхЧастей") Тогда
		
		Если ТипЗнч(Параметры.СоответствияРеквизитовТабличныхЧастей) = Тип("Строка") 
			И ЭтоАдресВременногоХранилища(Параметры.СоответствияРеквизитовТабличныхЧастей) Тогда
				
			ТЗ_СоответствияРеквизитовТабличныхЧастей = ПолучитьИзВременногоХранилища(Параметры.СоответствияРеквизитовТабличныхЧастей);
			
			Если ТипЗнч(ТЗ_СоответствияРеквизитовТабличныхЧастей) = Тип("ТаблицаЗначений") Тогда
				СоответствияРеквизитовТабличныхЧастей.Загрузить(ТЗ_СоответствияРеквизитовТабличныхЧастей);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	ИнициализироватьФормуОбъекта(Ложь);
	
	Если ДоступныеТипыТаблиц.Количество() = 0 Или ДоступныеТабличныеЧасти.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Сопоставление реквизитов табличной части'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	РеквизитыФормы = ПолучитьРеквизиты();
	
	Для Каждого ЭлементГруппы Из Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы Цикл
		
		Если Не ЭлементГруппы.Видимость Или Не ЭлементГруппы.Доступность Или Не ЭлементГруппы.Вид = ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверитьЗаполнение = Ложь;
		
		ИмяРеквизитаСоответствия = СтрЗаменить(ЭлементГруппы.ПутьКДанным, "ИмяРеквизита", "");
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
			ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			
			Если СтрРазделить("Номенклатура,КоличествоПлан,КоличествоФакт", ",").Найти(ИмяРеквизитаСоответствия) <> Неопределено Тогда
				ПроверитьЗаполнение = Истина;
			КонецЕсли;
			
		ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			
			Если ИмяРеквизитаСоответствия = "ШтрихкодУпаковки" Тогда
				ПроверитьЗаполнение = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			
			Если ИмяРеквизитаСоответствия = "Ячейка" Тогда
				ПроверитьЗаполнение = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			Если СтрРазделить("Номенклатура,Серия", ",").Найти(ИмяРеквизитаСоответствия) <> Неопределено Тогда
				ПроверитьЗаполнение = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроверитьЗаполнение И Не ЗначениеЗаполнено(ЭтотОбъект[ЭлементГруппы.ПутьКДанным]) Тогда
			
			ЗаголовокПоля = ЭлементГруппы.Заголовок;
			
			Если ПустаяСтрока(ЗаголовокПоля) Тогда
			
				Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
					
					Если РеквизитФормы.Имя = ЭлементГруппы.ПутьКДанным Тогда
						ЗаголовокПоля = РеквизитФормы.Заголовок;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;

			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнено поле ""%1""'"), ?(ПустаяСтрока(ЗаголовокПоля), ЭлементГруппы.Имя, ЗаголовокПоля));

			SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ЭлементГруппы.Имя, , Отказ);                      
		
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ДоступныеТипыТаблиц;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТаблицыПриИзменении(Элемент)
	
	ПодобратьЗначенияИменРеквизитовАвтоматически();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	ПодобратьЗначенияИменРеквизитовАвтоматически();
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("СоответствияРеквизитовТабличныхЧастей", ПодготовитьТаблицуСоответствияРеквизитовТабличныхЧастейДляСохранения());
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФормуОбъекта(АвтоматическиПодобратьЗначения = Истина)

	Для Каждого ТипТаблицыДокументаОбмена Из Перечисления.SUI_ТипыТаблицДокументовОбмена Цикл
		Если ТипТаблицыДокументаОбмена = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеТипыТаблиц.Добавить(ТипТаблицыДокументаОбмена);
	КонецЦикла;
	
	ТЗ_СоответствияРеквизитовТабличныхЧастей = СоответствияРеквизитовТабличныхЧастей.Выгрузить();
	
	ТЗ_СоответствияРеквизитовТабличныхЧастей.Свернуть("ИмяТабличнойЧасти, ТипТаблицы");
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяОбъектаМетаданных);
	
	Для Каждого МетаданныеТабличнойЧасти Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		НайденныеСтроки = ТЗ_СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти", МетаданныеТабличнойЧасти.Имя));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если ИмяТабличнойЧасти <> МетаданныеТабличнойЧасти.Имя Тогда
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
					НайденныйТипТаблицы = ДоступныеТипыТаблиц.НайтиПоЗначению(НайденнаяСтрока.ТипТаблицы);
					
					Если НайденныйТипТаблицы <> Неопределено Тогда
						ДоступныеТипыТаблиц.Удалить(НайденныйТипТаблицы);
					КонецЕсли;
					
				КонецЦикла;
				
				Продолжить;
			
			Иначе
				ТипТаблицы = НайденныеСтроки[0].ТипТаблицы;
			КонецЕсли;
			
		КонецЕсли;
		
		ДоступныеТабличныеЧасти.Добавить(МетаданныеТабличнойЧасти.Имя, МетаданныеТабличнойЧасти.Синоним);
		
	КонецЦикла;
	
	НайденныеСтрокиТовары = ТЗ_СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ТипТаблицы", Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары));
		
	Если НайденныеСтрокиТовары.Количество() > 0 Тогда
		
		НайденноеЗначениеОтбор = ДоступныеТипыТаблиц.НайтиПоЗначению(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
		Если НайденноеЗначениеОтбор <> Неопределено Тогда
			ДоступныеТипыТаблиц.Удалить(НайденноеЗначениеОтбор);
		КонецЕсли;
		
		НайденноеЗначениеРазмещение = ДоступныеТипыТаблиц.НайтиПоЗначению(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
		Если НайденноеЗначениеРазмещение <> Неопределено Тогда
			ДоступныеТипыТаблиц.Удалить(НайденноеЗначениеРазмещение);
		КонецЕсли;

	Иначе
		
		НайденныеСтрокиОтбор 		= ТЗ_СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ТипТаблицы", Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор));
		НайденныеСтрокиРазмещение 	= ТЗ_СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ТипТаблицы", Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение));
		
		Если НайденныеСтрокиОтбор.Количество() > 0 Или НайденныеСтрокиРазмещение.Количество() > 0 Тогда
		
			НайденноеЗначениеТовары = ДоступныеТипыТаблиц.НайтиПоЗначению(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
			Если НайденноеЗначениеТовары <> Неопределено Тогда
				ДоступныеТипыТаблиц.Удалить(НайденноеЗначениеТовары);
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ИмяТабличнойЧасти.СписокВыбора.ЗагрузитьЗначения(ДоступныеТабличныеЧасти.ВыгрузитьЗначения());
	
	ИнициализироватьСпискиВыбора();
	
	ЗаполнитьЗначенияИзФормы();
	
	ПодобратьЗначенияИменРеквизитовАвтоматически(АвтоматическиПодобратьЗначения);
	
//	// TODO: Временное отключение типа таблицы Отбор
//	НайденныйТипТаблицы = ДоступныеТипыТаблиц.НайтиПоЗначению(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
//	Если НайденныйТипТаблицы <> Неопределено Тогда
//		ДоступныеТипыТаблиц.Удалить(НайденныйТипТаблицы);
//	КонецЕсли;
//			
//	// TODO: Временное отключение типа таблицы Размещение
//	НайденныйТипТаблицы = ДоступныеТипыТаблиц.НайтиПоЗначению(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
//	Если НайденныйТипТаблицы <> Неопределено Тогда
//		ДоступныеТипыТаблиц.Удалить(НайденныйТипТаблицы);
//	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСпискиВыбора()
	
	РеквизитыТабличнойЧасти = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда

		МетаданныеТабличнойЧасти = Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти.Найти(ИмяТабличнойЧасти);

		Если МетаданныеТабличнойЧасти <> Неопределено Тогда
			
			Для Каждого МетаданныеРеквизитаТабличнойЧасти Из МетаданныеТабличнойЧасти.Реквизиты Цикл
				РеквизитыТабличнойЧасти.Добавить(МетаданныеРеквизитаТабличнойЧасти.Имя);
			КонецЦикла;
			
		КонецЕсли;
		
		РеквизитыТабличнойЧасти.СортироватьПоЗначению();
		
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы Цикл
		
		Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Элемент.СписокВыбора.ЗагрузитьЗначения(РеквизитыТабличнойЧасти.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьЗначенияИменРеквизитовАвтоматически(АвтоматическиПодобратьЗначения = Истина)
	
	Если ЗначениеЗаполнено(ТипТаблицы) И Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		
		НайденноеЗначениеИмяТЧ = Неопределено;
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
			НайденноеЗначениеИмяТЧ = Элементы.ИмяТабличнойЧасти.СписокВыбора.НайтиПоЗначению("Товары");
		ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			НайденноеЗначениеИмяТЧ = Элементы.ИмяТабличнойЧасти.СписокВыбора.НайтиПоЗначению("ШтрихкодыУпаковок");
		ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
			НайденноеЗначениеИмяТЧ = Элементы.ИмяТабличнойЧасти.СписокВыбора.НайтиПоЗначению("ТоварыОтбор");
		ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			НайденноеЗначениеИмяТЧ = Элементы.ИмяТабличнойЧасти.СписокВыбора.НайтиПоЗначению("ТоварыРазмещение");
		ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			НайденноеЗначениеИмяТЧ = Элементы.ИмяТабличнойЧасти.СписокВыбора.НайтиПоЗначению("Серии");
		КонецЕсли;
		
		Если НайденноеЗначениеИмяТЧ <> Неопределено Тогда
			
			ИмяТабличнойЧасти = НайденноеЗначениеИмяТЧ.Значение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимостьЭлементовФормы();
	
	ИнициализироватьСпискиВыбора();
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		
		Если АвтоматическиПодобратьЗначения Тогда
			
			Для Каждого ЭлементГруппы Из Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы Цикл
	
				Если Не ЭлементГруппы.Видимость Или Не ЭлементГруппы.Доступность Или Не ЭлементГруппы.Вид = ВидПоляФормы.ПолеВвода Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЭтотОбъект[ЭлементГруппы.ПутьКДанным]) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденноеЗначение = ЭлементГруппы.СписокВыбора.НайтиПоЗначению(СтрЗаменить(ЭлементГруппы.ПутьКДанным, "ИмяРеквизита", ""));
				
				Если НайденноеЗначение <> Неопределено Тогда
					ЭтотОбъект[ЭлементГруппы.ПутьКДанным] = НайденноеЗначение.Значение;
				КонецЕсли;
	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИзФормы()
	
	Если Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		ТипТаблицы = НайденныеСтроки[0].ТипТаблицы;
		
		НайденныеСтроки = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ТипТаблицы, ИмяТабличнойЧасти", ТипТаблицы, ИмяТабличнойЧасти));
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НайденныйЭлемент = Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы.Найти("ИмяРеквизита" + НайденнаяСтрока.Ключ);
			
			Если НайденныйЭлемент <> Неопределено Тогда
			
				Если Не НайденныйЭлемент.Видимость Или Не НайденныйЭлемент.Доступность Или Не НайденныйЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
					СоответствияРеквизитовТабличныхЧастей.Удалить(НайденнаяСтрока);
					Продолжить;
				КонецЕсли;
				
				НайденноеЗначениеСписка = НайденныйЭлемент.СписокВыбора.НайтиПоЗначению(НайденнаяСтрока.Значение);
				
				Если НайденноеЗначениеСписка = Неопределено Тогда
					СоответствияРеквизитовТабличныхЧастей.Удалить(НайденнаяСтрока);
					Продолжить;
				КонецЕсли;
				
				Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
					
					Если СтрРазделить("Номенклатура,Характеристика,Серия,СтатусУказанияСерий,Упаковка,Ячейка,КоличествоПлан,КоличествоФакт", ",").Найти(НайденнаяСтрока.Ключ) <> Неопределено Тогда
						ЭтотОбъект[НайденныйЭлемент.ПутьКДанным] = НайденнаяСтрока.Значение;
					КонецЕсли;

				КонецЕсли;
				 
				Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
					
					Если НайденнаяСтрока.Ключ = "ВидЦены" Или НайденнаяСтрока.Ключ = "Цена" Тогда
						ЭтотОбъект[НайденныйЭлемент.ПутьКДанным] = НайденнаяСтрока.Значение;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
					
					Если НайденнаяСтрока.Ключ = "ШтрихкодУпаковки" Тогда
						ЭтотОбъект[НайденныйЭлемент.ПутьКДанным] = НайденнаяСтрока.Значение;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
					Если СтрРазделить("Номенклатура,Характеристика,Серия,Склад,КоличествоФакт", ",").Найти(НайденнаяСтрока.Ключ) <> Неопределено Тогда
						ЭтотОбъект[НайденныйЭлемент.ПутьКДанным] = НайденнаяСтрока.Значение;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;

			СоответствияРеквизитовТабличныхЧастей.Удалить(НайденнаяСтрока);
			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуСоответствияРеквизитовТабличныхЧастейДляСохранения()
	
	НайденныеСтроки = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("ТипТаблицы, ИмяТабличнойЧасти", ТипТаблицы, ИмяТабличнойЧасти));

	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СоответствияРеквизитовТабличныхЧастей.Удалить(НайденнаяСтрока);
	КонецЦикла;

	Для Каждого ЭлементГруппы Из Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы Цикл
		
		Если Не ЭлементГруппы.Видимость Или Не ЭлементГруппы.Доступность Или Не ЭлементГруппы.Вид = ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаСоответствия = СоответствияРеквизитовТабличныхЧастей.Добавить();
		
		НоваяСтрокаСоответствия.ТипТаблицы = ТипТаблицы;
		НоваяСтрокаСоответствия.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрокаСоответствия.Ключ = СтрЗаменить(ЭлементГруппы.ПутьКДанным, "ИмяРеквизита", "");
		НоваяСтрокаСоответствия.Значение = ЭтотОбъект[ЭлементГруппы.ПутьКДанным];
		
	КонецЦикла;

	Возврат ПоместитьВоВременноеХранилище(СоответствияРеквизитовТабличныхЧастей.Выгрузить());

КонецФункции

&НаСервере
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Элементы.ИмяТабличнойЧасти.Видимость = ЗначениеЗаполнено(ТипТаблицы);
	
	Элементы.ГруппаСопоставлениеРеквизитов.Видимость = ЗначениеЗаполнено(ИмяТабличнойЧасти);
	
	Для Каждого ЭлементГруппы Из Элементы.ГруппаСопоставлениеРеквизитов.ПодчиненныеЭлементы Цикл
		
		Если ЭлементГруппы.Вид <> ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементГруппы.Видимость = Ложь;
		
		ИмяРеквизитаСоответствия = СтрЗаменить(ЭлементГруппы.ПутьКДанным, "ИмяРеквизита", "");
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
			ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			
			Если СтрРазделить("Номенклатура,Характеристика,Серия,СтатусУказанияСерий,Упаковка,Ячейка,КоличествоПлан,КоличествоФакт", ",").Найти(ИмяРеквизитаСоответствия) <> Неопределено Тогда
				ЭлементГруппы.Видимость = Истина;
			КонецЕсли;

		КонецЕсли;
		 
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
			
			Если ИмяРеквизитаСоответствия = "ВидЦены" Или ИмяРеквизитаСоответствия = "Цена" Тогда
				ЭлементГруппы.Видимость = Истина;
			КонецЕсли;
			
			// TODO: Врем. откл.
			Если ИмяРеквизитаСоответствия = "Ячейка" Тогда
				ЭлементГруппы.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			
			Если ИмяРеквизитаСоответствия = "ШтрихкодУпаковки" Тогда
				ЭлементГруппы.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			Если СтрРазделить("Номенклатура,Характеристика,Серия,Склад,КоличествоФакт", ",").Найти(ИмяРеквизитаСоответствия) <> Неопределено Тогда
				
				ЭлементГруппы.Видимость = Истина;
				
				Если ИмяРеквизитаСоответствия = "КоличествоФакт" Тогда
					ЭлементГруппы.Заголовок = НСтр("ru = 'Количество'")
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
